ctrl + /   - Закоментировать код
html:5 + tab - Каркас html




Ctrl + F	Поиск по файлу
Ctrl + R	Замена найденных символов
Ctrl + D	Создать дубликат текущей строки
Ctrl + Y	Удаление всей текущей строки
Ctrl-W	    Выделить блок кода (слово/строка/документ)

Ctrl + Shift + up	       Переместить текущую строку на одну строку вверх
Ctrl + Shift + down	       Переместить текущую строку на одну строку вниз
Ctrl + /	               Добавить строчный комментарий
Ctrl + Shift + /	       Добавить блочный комментарий
Ctrl + ALT + L	           Восстанавливает форматирование кода, согласно настройкам
ALT + J + Click	           Множественный курсор (нажать и немного подержать - выделит все вхождения)
Ctrl + Shift + Backspace   Вернуться к предыдущему месту редактирования